---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
source: html/cf6b23c9-5518-1ef1-1750-ad5151a977fc.htm
---
# IndexStreamLine Members

Inserts a IndexLine segment into the stream and associated buffer.